SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_gpio.h
/**
  * @brief GPIO_ODR Register Bit Definition
  */
#define  GPIO_ODR_ODR0_Pos                        (0)
#define  GPIO_ODR_ODR0_Msk                        (0x1U << GPIO_ODR_ODR0_Pos)                       /*!<Port output data*/
#define  GPIO_ODR_ODR0                            GPIO_ODR_ODR0_Msk
#define  GPIO_ODR_ODR1_Pos                        (1)
#define  GPIO_ODR_ODR1_Msk                        (0x1U << GPIO_ODR_ODR1_Pos)                       /*!<Port output data*/
#define  GPIO_ODR_ODR1                            GPIO_ODR_ODR1_Msk
#define  GPIO_ODR_ODR2_Pos                        (2)
#define  GPIO_ODR_ODR2_Msk                        (0x1U << GPIO_ODR_ODR2_Pos)                       /*!<Port output data*/
#define  GPIO_ODR_ODR2                            GPIO_ODR_ODR2_Msk
#define  GPIO_ODR_ODR3_Pos                        (3)
#define  GPIO_ODR_ODR3_Msk                        (0x1U << GPIO_ODR_ODR3_Pos)                       /*!<Port output data*/
#define  GPIO_ODR_ODR3                            GPIO_ODR_ODR3_Msk
#define  GPIO_ODR_ODR4_Pos                        (4)
#define  GPIO_ODR_ODR4_Msk                        (0x1U << GPIO_ODR_ODR4_Pos)                       /*!<Port output data*/
#define  GPIO_ODR_ODR4                            GPIO_ODR_ODR4_Msk
#define  GPIO_ODR_ODR5_Pos                        (5)
#define  GPIO_ODR_ODR5_Msk                        (0x1U << GPIO_ODR_ODR5_Pos)                       /*!<Port output data*/
#define  GPIO_ODR_ODR5                            GPIO_ODR_ODR5_Msk
#define  GPIO_ODR_ODR6_Pos                        (6)
#define  GPIO_ODR_ODR6_Msk                        (0x1U << GPIO_ODR_ODR6_Pos)                       /*!<Port output data*/
#define  GPIO_ODR_ODR6                            GPIO_ODR_ODR6_Msk
#define  GPIO_ODR_ODR7_Pos                        (7)
#define  GPIO_ODR_ODR7_Msk                        (0x1U << GPIO_ODR_ODR7_Pos)                       /*!<Port output data*/
#define  GPIO_ODR_ODR7                            GPIO_ODR_ODR7_Msk
#define  GPIO_ODR_ODR8_Pos                        (8)
#define  GPIO_ODR_ODR8_Msk                        (0x1U << GPIO_ODR_ODR8_Pos)                       /*!<Port output data*/
#define  GPIO_ODR_ODR8                            GPIO_ODR_ODR8_Msk
#define  GPIO_ODR_ODR9_Pos                        (9)
#define  GPIO_ODR_ODR9_Msk                        (0x1U << GPIO_ODR_ODR9_Pos)                       /*!<Port output data*/
#define  GPIO_ODR_ODR9                            GPIO_ODR_ODR9_Msk
#define  GPIO_ODR_ODR10_Pos                       (10)
#define  GPIO_ODR_ODR10_Msk                       (0x1U << GPIO_ODR_ODR10_Pos)                      /*!<Port output data*/
#define  GPIO_ODR_ODR10                           GPIO_ODR_ODR10_Msk
#define  GPIO_ODR_ODR11_Pos                       (11)
#define  GPIO_ODR_ODR11_Msk                       (0x1U << GPIO_ODR_ODR11_Pos)                      /*!<Port output data*/
#define  GPIO_ODR_ODR11                           GPIO_ODR_ODR11_Msk
#define  GPIO_ODR_ODR12_Pos                       (12)
#define  GPIO_ODR_ODR12_Msk                       (0x1U << GPIO_ODR_ODR12_Pos)                      /*!<Port output data*/
#define  GPIO_ODR_ODR12                           GPIO_ODR_ODR12_Msk
#define  GPIO_ODR_ODR13_Pos                       (13)
#define  GPIO_ODR_ODR13_Msk                       (0x1U << GPIO_ODR_ODR13_Pos)                      /*!<Port output data*/
#define  GPIO_ODR_ODR13                           GPIO_ODR_ODR13_Msk
#define  GPIO_ODR_ODR14_Pos                       (14)
#define  GPIO_ODR_ODR14_Msk                       (0x1U << GPIO_ODR_ODR14_Pos)                      /*!<Port output data*/
#define  GPIO_ODR_ODR14                           GPIO_ODR_ODR14_Msk
#define  GPIO_ODR_ODR15_Pos                       (15)
#define  GPIO_ODR_ODR15_Msk                       (0x1U << GPIO_ODR_ODR15_Pos)                      /*!<Port output data*/
#define  GPIO_ODR_ODR15                           GPIO_ODR_ODR15_Msk

/**
  * @brief GPIO_BSRR Register Bit Definition
  */
#define  GPIO_BSRR_BS0_Pos                        (0)
#define  GPIO_BSRR_BS0_Msk                        (0x1U << GPIO_BSRR_BS0_Pos)                       /*!<Port Set bit*/
#define  GPIO_BSRR_BS0                            GPIO_BSRR_BS0_Msk
#define  GPIO_BSRR_BS1_Pos                        (1)
#define  GPIO_BSRR_BS1_Msk                        (0x1U << GPIO_BSRR_BS1_Pos)                       /*!<Port Set bit*/
#define  GPIO_BSRR_BS1                            GPIO_BSRR_BS1_Msk
#define  GPIO_BSRR_BS2_Pos                        (2)
#define  GPIO_BSRR_BS2_Msk                        (0x1U << GPIO_BSRR_BS2_Pos)                       /*!<Port Set bit*/
#define  GPIO_BSRR_BS2                            GPIO_BSRR_BS2_Msk
#define  GPIO_BSRR_BS3_Pos                        (3)
#define  GPIO_BSRR_BS3_Msk                        (0x1U << GPIO_BSRR_BS3_Pos)                       /*!<Port Set bit*/
#define  GPIO_BSRR_BS3                            GPIO_BSRR_BS3_Msk
#define  GPIO_BSRR_BS4_Pos                        (4)
#define  GPIO_BSRR_BS4_Msk                        (0x1U << GPIO_BSRR_BS4_Pos)                       /*!<Port Set bit*/
#define  GPIO_BSRR_BS4                            GPIO_BSRR_BS4_Msk
#define  GPIO_BSRR_BS5_Pos                        (5)
#define  GPIO_BSRR_BS5_Msk                        (0x1U << GPIO_BSRR_BS5_Pos)                       /*!<Port Set bit*/
#define  GPIO_BSRR_BS5                            GPIO_BSRR_BS5_Msk
#define  GPIO_BSRR_BS6_Pos                        (6)
#define  GPIO_BSRR_BS6_Msk                        (0x1U << GPIO_BSRR_BS6_Pos)                       /*!<Port Set bit*/
#define  GPIO_BSRR_BS6                            GPIO_BSRR_BS6_Msk
#define  GPIO_BSRR_BS7_Pos                        (7)
#define  GPIO_BSRR_BS7_Msk                        (0x1U << GPIO_BSRR_BS7_Pos)                       /*!<Port Set bit*/
#define  GPIO_BSRR_BS7                            GPIO_BSRR_BS7_Msk
#define  GPIO_BSRR_BS8_Pos                        (8)
#define  GPIO_BSRR_BS8_Msk                        (0x1U << GPIO_BSRR_BS8_Pos)                       /*!<Port Set bit*/
#define  GPIO_BSRR_BS8                            GPIO_BSRR_BS8_Msk
#define  GPIO_BSRR_BS9_Pos                        (9)
#define  GPIO_BSRR_BS9_Msk                        (0x1U << GPIO_BSRR_BS9_Pos)                       /*!<Port Set bit*/
#define  GPIO_BSRR_BS9                            GPIO_BSRR_BS9_Msk
#define  GPIO_BSRR_BS10_Pos                       (10)
#define  GPIO_BSRR_BS10_Msk                       (0x1U << GPIO_BSRR_BS10_Pos)                      /*!<Port Set bit*/
#define  GPIO_BSRR_BS10                           GPIO_BSRR_BS10_Msk
#define  GPIO_BSRR_BS11_Pos                       (11)
#define  GPIO_BSRR_BS11_Msk                       (0x1U << GPIO_BSRR_BS11_Pos)                      /*!<Port Set bit*/
#define  GPIO_BSRR_BS11                           GPIO_BSRR_BS11_Msk
#define  GPIO_BSRR_BS12_Pos                       (12)
#define  GPIO_BSRR_BS12_Msk                       (0x1U << GPIO_BSRR_BS12_Pos)                      /*!<Port Set bit*/
#define  GPIO_BSRR_BS12                           GPIO_BSRR_BS12_Msk
#define  GPIO_BSRR_BS13_Pos                       (13)
#define  GPIO_BSRR_BS13_Msk                       (0x1U << GPIO_BSRR_BS13_Pos)                      /*!<Port Set bit*/
#define  GPIO_BSRR_BS13                           GPIO_BSRR_BS13_Msk
#define  GPIO_BSRR_BS14_Pos                       (14)
#define  GPIO_BSRR_BS14_Msk                       (0x1U << GPIO_BSRR_BS14_Pos)                      /*!<Port Set bit*/
#define  GPIO_BSRR_BS14                           GPIO_BSRR_BS14_Msk
#define  GPIO_BSRR_BS15_Pos                       (15)
#define  GPIO_BSRR_BS15_Msk                       (0x1U << GPIO_BSRR_BS15_Pos)                      /*!<Port Set bit*/
#define  GPIO_BSRR_BS15                           GPIO_BSRR_BS15_Msk
#define  GPIO_BSRR_BR0_Pos                        (16)
#define  GPIO_BSRR_BR0_Msk                        (0x1U << GPIO_BSRR_BR0_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BSRR_BR0                            GPIO_BSRR_BR0_Msk
#define  GPIO_BSRR_BR1_Pos                        (17)
#define  GPIO_BSRR_BR1_Msk                        (0x1U << GPIO_BSRR_BR1_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BSRR_BR1                            GPIO_BSRR_BR1_Msk
#define  GPIO_BSRR_BR2_Pos                        (18)
#define  GPIO_BSRR_BR2_Msk                        (0x1U << GPIO_BSRR_BR2_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BSRR_BR2                            GPIO_BSRR_BR2_Msk
#define  GPIO_BSRR_BR3_Pos                        (19)
#define  GPIO_BSRR_BR3_Msk                        (0x1U << GPIO_BSRR_BR3_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BSRR_BR3                            GPIO_BSRR_BR3_Msk
#define  GPIO_BSRR_BR4_Pos                        (20)
#define  GPIO_BSRR_BR4_Msk                        (0x1U << GPIO_BSRR_BR4_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BSRR_BR4                            GPIO_BSRR_BR4_Msk
#define  GPIO_BSRR_BR5_Pos                        (21)
#define  GPIO_BSRR_BR5_Msk                        (0x1U << GPIO_BSRR_BR5_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BSRR_BR5                            GPIO_BSRR_BR5_Msk
#define  GPIO_BSRR_BR6_Pos                        (22)
#define  GPIO_BSRR_BR6_Msk                        (0x1U << GPIO_BSRR_BR6_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BSRR_BR6                            GPIO_BSRR_BR6_Msk
#define  GPIO_BSRR_BR7_Pos                        (23)
#define  GPIO_BSRR_BR7_Msk                        (0x1U << GPIO_BSRR_BR7_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BSRR_BR7                            GPIO_BSRR_BR7_Msk
#define  GPIO_BSRR_BR8_Pos                        (24)
#define  GPIO_BSRR_BR8_Msk                        (0x1U << GPIO_BSRR_BR8_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BSRR_BR8                            GPIO_BSRR_BR8_Msk
#define  GPIO_BSRR_BR9_Pos                        (25)
#define  GPIO_BSRR_BR9_Msk                        (0x1U << GPIO_BSRR_BR9_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BSRR_BR9                            GPIO_BSRR_BR9_Msk
#define  GPIO_BSRR_BR10_Pos                       (26)
#define  GPIO_BSRR_BR10_Msk                       (0x1U << GPIO_BSRR_BR10_Pos)                      /*!<Port Reset bit*/
#define  GPIO_BSRR_BR10                           GPIO_BSRR_BR10_Msk
#define  GPIO_BSRR_BR11_Pos                       (27)
#define  GPIO_BSRR_BR11_Msk                       (0x1U << GPIO_BSRR_BR11_Pos)                      /*!<Port Reset bit*/
#define  GPIO_BSRR_BR11                           GPIO_BSRR_BR11_Msk
#define  GPIO_BSRR_BR12_Pos                       (28)
#define  GPIO_BSRR_BR12_Msk                       (0x1U << GPIO_BSRR_BR12_Pos)                      /*!<Port Reset bit*/
#define  GPIO_BSRR_BR12                           GPIO_BSRR_BR12_Msk
#define  GPIO_BSRR_BR13_Pos                       (29)
#define  GPIO_BSRR_BR13_Msk                       (0x1U << GPIO_BSRR_BR13_Pos)                      /*!<Port Reset bit*/
#define  GPIO_BSRR_BR13                           GPIO_BSRR_BR13_Msk
#define  GPIO_BSRR_BR14_Pos                       (30)
#define  GPIO_BSRR_BR14_Msk                       (0x1U << GPIO_BSRR_BR14_Pos)                      /*!<Port Reset bit*/
#define  GPIO_BSRR_BR14                           GPIO_BSRR_BR14_Msk
#define  GPIO_BSRR_BR15_Pos                       (31)
#define  GPIO_BSRR_BR15_Msk                       (0x1U << GPIO_BSRR_BR15_Pos)                      /*!<Port Reset bit*/
#define  GPIO_BSRR_BR15                           GPIO_BSRR_BR15_Msk

/**
  * @brief GPIO_BRR Register Bit Definition
  */
#define  GPIO_BRR_BR0_Pos                         (0)
#define  GPIO_BRR_BR0_Msk                         (0x1U << GPIO_BRR_BR0_Pos)                        /*!<Port Reset bit*/
#define  GPIO_BRR_BR0                             GPIO_BRR_BR0_Msk
#define  GPIO_BRR_BR1_Pos                         (1)
#define  GPIO_BRR_BR1_Msk                         (0x1U << GPIO_BRR_BR1_Pos)                        /*!<Port Reset bit*/
#define  GPIO_BRR_BR1                             GPIO_BRR_BR1_Msk
#define  GPIO_BRR_BR2_Pos                         (2)
#define  GPIO_BRR_BR2_Msk                         (0x1U << GPIO_BRR_BR2_Pos)                        /*!<Port Reset bit*/
#define  GPIO_BRR_BR2                             GPIO_BRR_BR2_Msk
#define  GPIO_BRR_BR3_Pos                         (3)
#define  GPIO_BRR_BR3_Msk                         (0x1U << GPIO_BRR_BR3_Pos)                        /*!<Port Reset bit*/
#define  GPIO_BRR_BR3                             GPIO_BRR_BR3_Msk
#define  GPIO_BRR_BR4_Pos                         (4)
#define  GPIO_BRR_BR4_Msk                         (0x1U << GPIO_BRR_BR4_Pos)                        /*!<Port Reset bit*/
#define  GPIO_BRR_BR4                             GPIO_BRR_BR4_Msk
#define  GPIO_BRR_BR5_Pos                         (5)
#define  GPIO_BRR_BR5_Msk                         (0x1U << GPIO_BRR_BR5_Pos)                        /*!<Port Reset bit*/
#define  GPIO_BRR_BR5                             GPIO_BRR_BR5_Msk
#define  GPIO_BRR_BR6_Pos                         (6)
#define  GPIO_BRR_BR6_Msk                         (0x1U << GPIO_BRR_BR6_Pos)                        /*!<Port Reset bit*/
#define  GPIO_BRR_BR6                             GPIO_BRR_BR6_Msk
#define  GPIO_BRR_BR7_Pos                         (7)
#define  GPIO_BRR_BR7_Msk                         (0x1U << GPIO_BRR_BR7_Pos)                        /*!<Port Reset bit*/
#define  GPIO_BRR_BR7                             GPIO_BRR_BR7_Msk
#define  GPIO_BRR_BR8_Pos                         (8)
#define  GPIO_BRR_BR8_Msk                         (0x1U << GPIO_BRR_BR8_Pos)                        /*!<Port Reset bit*/
#define  GPIO_BRR_BR8                             GPIO_BRR_BR8_Msk
#define  GPIO_BRR_BR9_Pos                         (9)
#define  GPIO_BRR_BR9_Msk                         (0x1U << GPIO_BRR_BR9_Pos)                        /*!<Port Reset bit*/
#define  GPIO_BRR_BR9                             GPIO_BRR_BR9_Msk
#define  GPIO_BRR_BR10_Pos                        (10)
#define  GPIO_BRR_BR10_Msk                        (0x1U << GPIO_BRR_BR10_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BRR_BR10                            GPIO_BRR_BR10_Msk
#define  GPIO_BRR_BR11_Pos                        (11)
#define  GPIO_BRR_BR11_Msk                        (0x1U << GPIO_BRR_BR11_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BRR_BR11                            GPIO_BRR_BR11_Msk
#define  GPIO_BRR_BR12_Pos                        (12)
#define  GPIO_BRR_BR12_Msk                        (0x1U << GPIO_BRR_BR12_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BRR_BR12                            GPIO_BRR_BR12_Msk
#define  GPIO_BRR_BR13_Pos                        (13)
#define  GPIO_BRR_BR13_Msk                        (0x1U << GPIO_BRR_BR13_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BRR_BR13                            GPIO_BRR_BR13_Msk
#define  GPIO_BRR_BR14_Pos                        (14)
#define  GPIO_BRR_BR14_Msk                        (0x1U << GPIO_BRR_BR14_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BRR_BR14                            GPIO_BRR_BR14_Msk
#define  GPIO_BRR_BR15_Pos                        (15)
#define  GPIO_BRR_BR15_Msk                        (0x1U << GPIO_BRR_BR15_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BRR_BR15                            GPIO_BRR_BR15_Msk

/**
  * @brief GPIO_LCKR Register Bit Definition
  */
#define  GPIO_LCKR_LCK0_Pos                       (0)
#define  GPIO_LCKR_LCK0_Msk                       (0x1U << GPIO_LCKR_LCK0_Pos)                      /*!<Lock bit*/
#define  GPIO_LCKR_LCK0                           GPIO_LCKR_LCK0_Msk
#define  GPIO_LCKR_LCK1_Pos                       (1)
#define  GPIO_LCKR_LCK1_Msk                       (0x1U << GPIO_LCKR_LCK1_Pos)                      /*!<Lock bit*/
#define  GPIO_LCKR_LCK1                           GPIO_LCKR_LCK1_Msk
#define  GPIO_LCKR_LCK2_Pos                       (2)
#define  GPIO_LCKR_LCK2_Msk                       (0x1U << GPIO_LCKR_LCK2_Pos)                      /*!<Lock bit*/
#define  GPIO_LCKR_LCK2                           GPIO_LCKR_LCK2_Msk
#define  GPIO_LCKR_LCK3_Pos                       (3)
#define  GPIO_LCKR_LCK3_Msk                       (0x1U << GPIO_LCKR_LCK3_Pos)                      /*!<Lock bit*/
#define  GPIO_LCKR_LCK3                           GPIO_LCKR_LCK3_Msk
#define  GPIO_LCKR_LCK4_Pos                       (4)
#define  GPIO_LCKR_LCK4_Msk                       (0x1U << GPIO_LCKR_LCK4_Pos)                      /*!<Lock bit*/
#define  GPIO_LCKR_LCK4                           GPIO_LCKR_LCK4_Msk
#define  GPIO_LCKR_LCK5_Pos                       (5)
#define  GPIO_LCKR_LCK5_Msk                       (0x1U << GPIO_LCKR_LCK5_Pos)                      /*!<Lock bit*/
#define  GPIO_LCKR_LCK5                           GPIO_LCKR_LCK5_Msk
#define  GPIO_LCKR_LCK6_Pos                       (6)
#define  GPIO_LCKR_LCK6_Msk                       (0x1U << GPIO_LCKR_LCK6_Pos)                      /*!<Lock bit*/
#define  GPIO_LCKR_LCK6                           GPIO_LCKR_LCK6_Msk
#define  GPIO_LCKR_LCK7_Pos                       (7)
#define  GPIO_LCKR_LCK7_Msk                       (0x1U << GPIO_LCKR_LCK7_Pos)                      /*!<Lock bit*/
#define  GPIO_LCKR_LCK7                           GPIO_LCKR_LCK7_Msk
#define  GPIO_LCKR_LCK8_Pos                       (8)
#define  GPIO_LCKR_LCK8_Msk                       (0x1U << GPIO_LCKR_LCK8_Pos)                      /*!<Lock bit*/
#define  GPIO_LCKR_LCK8                           GPIO_LCKR_LCK8_Msk
#define  GPIO_LCKR_LCK9_Pos                       (9)
#define  GPIO_LCKR_LCK9_Msk                       (0x1U << GPIO_LCKR_LCK9_Pos)                      /*!<Lock bit*/
#define  GPIO_LCKR_LCK9                           GPIO_LCKR_LCK9_Msk
#define  GPIO_LCKR_LCK10_Pos                      (10)
#define  GPIO_LCKR_LCK10_Msk                      (0x1U << GPIO_LCKR_LCK10_Pos)                     /*!<Lock bit*/
#define  GPIO_LCKR_LCK10                          GPIO_LCKR_LCK10_Msk
#define  GPIO_LCKR_LCK11_Pos                      (11)
#define  GPIO_LCKR_LCK11_Msk                      (0x1U << GPIO_LCKR_LCK11_Pos)                     /*!<Lock bit*/
#define  GPIO_LCKR_LCK11                          GPIO_LCKR_LCK11_Msk
#define  GPIO_LCKR_LCK12_Pos                      (12)
#define  GPIO_LCKR_LCK12_Msk                      (0x1U << GPIO_LCKR_LCK12_Pos)                     /*!<Lock bit*/
#define  GPIO_LCKR_LCK12                          GPIO_LCKR_LCK12_Msk
#define  GPIO_LCKR_LCK13_Pos                      (13)
#define  GPIO_LCKR_LCK13_Msk                      (0x1U << GPIO_LCKR_LCK13_Pos)                     /*!<Lock bit*/
#define  GPIO_LCKR_LCK13                          GPIO_LCKR_LCK13_Msk
#define  GPIO_LCKR_LCK14_Pos                      (14)
#define  GPIO_LCKR_LCK14_Msk                      (0x1U << GPIO_LCKR_LCK14_Pos)                     /*!<Lock bit*/
#define  GPIO_LCKR_LCK14                          GPIO_LCKR_LCK14_Msk
#define  GPIO_LCKR_LCK15_Pos                      (15)
#define  GPIO_LCKR_LCK15_Msk                      (0x1U << GPIO_LCKR_LCK15_Pos)                     /*!<Lock bit*/
#define  GPIO_LCKR_LCK15                          GPIO_LCKR_LCK15_Msk
#define  GPIO_LCKR_LCKK_Pos                       (16)
#define  GPIO_LCKR_LCKK_Msk                       (0x1U << GPIO_LCKR_LCKK_Pos)                      /*!<Lock key*/
#define  GPIO_LCKR_LCKK                           GPIO_LCKR_LCKK_Msk

