SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_gpio.h
/**
  * @brief GPIO_DCR Register Bit Definition
  */
#define  GPIO_DCR_PX0_Pos                         (0)
#define  GPIO_DCR_PX0_Msk                         (0x3U << GPIO_DCR_PX0_Pos)                        /*!<PX*/
#define  GPIO_DCR_PX0                             GPIO_DCR_PX0_Msk
#define  GPIO_DCR_PX0_Bit0                        (0x1U << GPIO_DCR_PX0_Pos) 
#define  GPIO_DCR_PX0_Bit1                        (0x2U << GPIO_DCR_PX0_Pos) 
#define  GPIO_DCR_PX1_Pos                         (2)
#define  GPIO_DCR_PX1_Msk                         (0x3U << GPIO_DCR_PX1_Pos)                        /*!<PX*/
#define  GPIO_DCR_PX1                             GPIO_DCR_PX1_Msk
#define  GPIO_DCR_PX1_Bit0                        (0x1U << GPIO_DCR_PX1_Pos) 
#define  GPIO_DCR_PX1_Bit1                        (0x2U << GPIO_DCR_PX1_Pos) 
#define  GPIO_DCR_PX2_Pos                         (4)
#define  GPIO_DCR_PX2_Msk                         (0x3U << GPIO_DCR_PX2_Pos)                        /*!<PX*/
#define  GPIO_DCR_PX2                             GPIO_DCR_PX2_Msk
#define  GPIO_DCR_PX2_Bit0                        (0x1U << GPIO_DCR_PX2_Pos) 
#define  GPIO_DCR_PX2_Bit1                        (0x2U << GPIO_DCR_PX2_Pos) 
#define  GPIO_DCR_PX3_Pos                         (6)
#define  GPIO_DCR_PX3_Msk                         (0x3U << GPIO_DCR_PX3_Pos)                        /*!<PX*/
#define  GPIO_DCR_PX3                             GPIO_DCR_PX3_Msk
#define  GPIO_DCR_PX3_Bit0                        (0x1U << GPIO_DCR_PX3_Pos) 
#define  GPIO_DCR_PX3_Bit1                        (0x2U << GPIO_DCR_PX3_Pos) 
#define  GPIO_DCR_PX4_Pos                         (8)
#define  GPIO_DCR_PX4_Msk                         (0x3U << GPIO_DCR_PX4_Pos)                        /*!<PX*/
#define  GPIO_DCR_PX4                             GPIO_DCR_PX4_Msk
#define  GPIO_DCR_PX4_Bit0                        (0x1U << GPIO_DCR_PX4_Pos) 
#define  GPIO_DCR_PX4_Bit1                        (0x2U << GPIO_DCR_PX4_Pos) 
#define  GPIO_DCR_PX5_Pos                         (10)
#define  GPIO_DCR_PX5_Msk                         (0x3U << GPIO_DCR_PX5_Pos)                        /*!<PX*/
#define  GPIO_DCR_PX5                             GPIO_DCR_PX5_Msk
#define  GPIO_DCR_PX5_Bit0                        (0x1U << GPIO_DCR_PX5_Pos) 
#define  GPIO_DCR_PX5_Bit1                        (0x2U << GPIO_DCR_PX5_Pos) 
#define  GPIO_DCR_PX6_Pos                         (12)
#define  GPIO_DCR_PX6_Msk                         (0x3U << GPIO_DCR_PX6_Pos)                        /*!<PX*/
#define  GPIO_DCR_PX6                             GPIO_DCR_PX6_Msk
#define  GPIO_DCR_PX6_Bit0                        (0x1U << GPIO_DCR_PX6_Pos) 
#define  GPIO_DCR_PX6_Bit1                        (0x2U << GPIO_DCR_PX6_Pos) 
#define  GPIO_DCR_PX7_Pos                         (14)
#define  GPIO_DCR_PX7_Msk                         (0x3U << GPIO_DCR_PX7_Pos)                        /*!<PX*/
#define  GPIO_DCR_PX7                             GPIO_DCR_PX7_Msk
#define  GPIO_DCR_PX7_Bit0                        (0x1U << GPIO_DCR_PX7_Pos) 
#define  GPIO_DCR_PX7_Bit1                        (0x2U << GPIO_DCR_PX7_Pos) 
#define  GPIO_DCR_PX8_Pos                         (16)
#define  GPIO_DCR_PX8_Msk                         (0x3U << GPIO_DCR_PX8_Pos)                        /*!<PX*/
#define  GPIO_DCR_PX8                             GPIO_DCR_PX8_Msk
#define  GPIO_DCR_PX8_Bit0                        (0x1U << GPIO_DCR_PX8_Pos) 
#define  GPIO_DCR_PX8_Bit1                        (0x2U << GPIO_DCR_PX8_Pos) 
#define  GPIO_DCR_PX9_Pos                         (18)
#define  GPIO_DCR_PX9_Msk                         (0x3U << GPIO_DCR_PX9_Pos)                        /*!<PX*/
#define  GPIO_DCR_PX9                             GPIO_DCR_PX9_Msk
#define  GPIO_DCR_PX9_Bit0                        (0x1U << GPIO_DCR_PX9_Pos) 
#define  GPIO_DCR_PX9_Bit1                        (0x2U << GPIO_DCR_PX9_Pos) 
#define  GPIO_DCR_PX10_Pos                        (20)
#define  GPIO_DCR_PX10_Msk                        (0x3U << GPIO_DCR_PX10_Pos)                       /*!<PX*/
#define  GPIO_DCR_PX10                            GPIO_DCR_PX10_Msk
#define  GPIO_DCR_PX10_Bit0                       (0x1U << GPIO_DCR_PX10_Pos) 
#define  GPIO_DCR_PX10_Bit1                       (0x2U << GPIO_DCR_PX10_Pos) 
#define  GPIO_DCR_PX11_Pos                        (22)
#define  GPIO_DCR_PX11_Msk                        (0x3U << GPIO_DCR_PX11_Pos)                       /*!<PX*/
#define  GPIO_DCR_PX11                            GPIO_DCR_PX11_Msk
#define  GPIO_DCR_PX11_Bit0                       (0x1U << GPIO_DCR_PX11_Pos) 
#define  GPIO_DCR_PX11_Bit1                       (0x2U << GPIO_DCR_PX11_Pos) 
#define  GPIO_DCR_PX12_Pos                        (24)
#define  GPIO_DCR_PX12_Msk                        (0x3U << GPIO_DCR_PX12_Pos)                       /*!<PX*/
#define  GPIO_DCR_PX12                            GPIO_DCR_PX12_Msk
#define  GPIO_DCR_PX12_Bit0                       (0x1U << GPIO_DCR_PX12_Pos) 
#define  GPIO_DCR_PX12_Bit1                       (0x2U << GPIO_DCR_PX12_Pos) 
#define  GPIO_DCR_PX13_Pos                        (26)
#define  GPIO_DCR_PX13_Msk                        (0x3U << GPIO_DCR_PX13_Pos)                       /*!<PX*/
#define  GPIO_DCR_PX13                            GPIO_DCR_PX13_Msk
#define  GPIO_DCR_PX13_Bit0                       (0x1U << GPIO_DCR_PX13_Pos) 
#define  GPIO_DCR_PX13_Bit1                       (0x2U << GPIO_DCR_PX13_Pos) 
#define  GPIO_DCR_PX14_Pos                        (28)
#define  GPIO_DCR_PX14_Msk                        (0x3U << GPIO_DCR_PX14_Pos)                       /*!<PX*/
#define  GPIO_DCR_PX14                            GPIO_DCR_PX14_Msk
#define  GPIO_DCR_PX14_Bit0                       (0x1U << GPIO_DCR_PX14_Pos) 
#define  GPIO_DCR_PX14_Bit1                       (0x2U << GPIO_DCR_PX14_Pos) 
#define  GPIO_DCR_PX15_Pos                        (30)
#define  GPIO_DCR_PX15_Msk                        (0x3U << GPIO_DCR_PX15_Pos)                       /*!<PX*/
#define  GPIO_DCR_PX15                            GPIO_DCR_PX15_Msk
#define  GPIO_DCR_PX15_Bit0                       (0x1U << GPIO_DCR_PX15_Pos) 
#define  GPIO_DCR_PX15_Bit1                       (0x2U << GPIO_DCR_PX15_Pos) 

/**
  * @brief GPIO_AFRL Register Bit Definition
  */
#define  GPIO_AFRL_AFR0_Pos                       (0)
#define  GPIO_AFRL_AFR0_Msk                       (0xFU << GPIO_AFRL_AFR0_Pos)                      /*!<See AFR7.*/
#define  GPIO_AFRL_AFR0                           GPIO_AFRL_AFR0_Msk
#define  GPIO_AFRL_AFR0_Bit0                      (0x1U << GPIO_AFRL_AFR0_Pos) 
#define  GPIO_AFRL_AFR0_Bit1                      (0x2U << GPIO_AFRL_AFR0_Pos) 
#define  GPIO_AFRL_AFR0_Bit2                      (0x4U << GPIO_AFRL_AFR0_Pos) 
#define  GPIO_AFRL_AFR0_Bit3                      (0x8U << GPIO_AFRL_AFR0_Pos) 
#define  GPIO_AFRL_AFR1_Pos                       (4)
#define  GPIO_AFRL_AFR1_Msk                       (0xFU << GPIO_AFRL_AFR1_Pos)                      /*!<See AFR7.*/
#define  GPIO_AFRL_AFR1                           GPIO_AFRL_AFR1_Msk
#define  GPIO_AFRL_AFR1_Bit0                      (0x1U << GPIO_AFRL_AFR1_Pos) 
#define  GPIO_AFRL_AFR1_Bit1                      (0x2U << GPIO_AFRL_AFR1_Pos) 
#define  GPIO_AFRL_AFR1_Bit2                      (0x4U << GPIO_AFRL_AFR1_Pos) 
#define  GPIO_AFRL_AFR1_Bit3                      (0x8U << GPIO_AFRL_AFR1_Pos) 
#define  GPIO_AFRL_AFR2_Pos                       (8)
#define  GPIO_AFRL_AFR2_Msk                       (0xFU << GPIO_AFRL_AFR2_Pos)                      /*!<See AFR7.*/
#define  GPIO_AFRL_AFR2                           GPIO_AFRL_AFR2_Msk
#define  GPIO_AFRL_AFR2_Bit0                      (0x1U << GPIO_AFRL_AFR2_Pos) 
#define  GPIO_AFRL_AFR2_Bit1                      (0x2U << GPIO_AFRL_AFR2_Pos) 
#define  GPIO_AFRL_AFR2_Bit2                      (0x4U << GPIO_AFRL_AFR2_Pos) 
#define  GPIO_AFRL_AFR2_Bit3                      (0x8U << GPIO_AFRL_AFR2_Pos) 
#define  GPIO_AFRL_AFR3_Pos                       (12)
#define  GPIO_AFRL_AFR3_Msk                       (0xFU << GPIO_AFRL_AFR3_Pos)                      /*!<See AFR7.*/
#define  GPIO_AFRL_AFR3                           GPIO_AFRL_AFR3_Msk
#define  GPIO_AFRL_AFR3_Bit0                      (0x1U << GPIO_AFRL_AFR3_Pos) 
#define  GPIO_AFRL_AFR3_Bit1                      (0x2U << GPIO_AFRL_AFR3_Pos) 
#define  GPIO_AFRL_AFR3_Bit2                      (0x4U << GPIO_AFRL_AFR3_Pos) 
#define  GPIO_AFRL_AFR3_Bit3                      (0x8U << GPIO_AFRL_AFR3_Pos) 
#define  GPIO_AFRL_AFR4_Pos                       (16)
#define  GPIO_AFRL_AFR4_Msk                       (0xFU << GPIO_AFRL_AFR4_Pos)                      /*!<See AFR7.*/
#define  GPIO_AFRL_AFR4                           GPIO_AFRL_AFR4_Msk
#define  GPIO_AFRL_AFR4_Bit0                      (0x1U << GPIO_AFRL_AFR4_Pos) 
#define  GPIO_AFRL_AFR4_Bit1                      (0x2U << GPIO_AFRL_AFR4_Pos) 
#define  GPIO_AFRL_AFR4_Bit2                      (0x4U << GPIO_AFRL_AFR4_Pos) 
#define  GPIO_AFRL_AFR4_Bit3                      (0x8U << GPIO_AFRL_AFR4_Pos) 
#define  GPIO_AFRL_AFR5_Pos                       (20)
#define  GPIO_AFRL_AFR5_Msk                       (0xFU << GPIO_AFRL_AFR5_Pos)                      /*!<See AFR7.*/
#define  GPIO_AFRL_AFR5                           GPIO_AFRL_AFR5_Msk
#define  GPIO_AFRL_AFR5_Bit0                      (0x1U << GPIO_AFRL_AFR5_Pos) 
#define  GPIO_AFRL_AFR5_Bit1                      (0x2U << GPIO_AFRL_AFR5_Pos) 
#define  GPIO_AFRL_AFR5_Bit2                      (0x4U << GPIO_AFRL_AFR5_Pos) 
#define  GPIO_AFRL_AFR5_Bit3                      (0x8U << GPIO_AFRL_AFR5_Pos) 
#define  GPIO_AFRL_AFR6_Pos                       (24)
#define  GPIO_AFRL_AFR6_Msk                       (0xFU << GPIO_AFRL_AFR6_Pos)                      /*!<See AFR7.*/
#define  GPIO_AFRL_AFR6                           GPIO_AFRL_AFR6_Msk
#define  GPIO_AFRL_AFR6_Bit0                      (0x1U << GPIO_AFRL_AFR6_Pos) 
#define  GPIO_AFRL_AFR6_Bit1                      (0x2U << GPIO_AFRL_AFR6_Pos) 
#define  GPIO_AFRL_AFR6_Bit2                      (0x4U << GPIO_AFRL_AFR6_Pos) 
#define  GPIO_AFRL_AFR6_Bit3                      (0x8U << GPIO_AFRL_AFR6_Pos) 
#define  GPIO_AFRL_AFR7_Pos                       (28)
#define  GPIO_AFRL_AFR7_Msk                       (0xFU << GPIO_AFRL_AFR7_Pos)                      /*!<Port x alternate function bit, which can be accessed by software to configure the function.Please refer to the AFRLE register bit description for details.*/
#define  GPIO_AFRL_AFR7                           GPIO_AFRL_AFR7_Msk
#define  GPIO_AFRL_AFR7_Bit0                      (0x1U << GPIO_AFRL_AFR7_Pos) 
#define  GPIO_AFRL_AFR7_Bit1                      (0x2U << GPIO_AFRL_AFR7_Pos) 
#define  GPIO_AFRL_AFR7_Bit2                      (0x4U << GPIO_AFRL_AFR7_Pos) 
#define  GPIO_AFRL_AFR7_Bit3                      (0x8U << GPIO_AFRL_AFR7_Pos) 

/**
  * @brief GPIO_AFRH Register Bit Definition
  */
#define  GPIO_AFRH_AFR8_Pos                       (0)
#define  GPIO_AFRH_AFR8_Msk                       (0xFU << GPIO_AFRH_AFR8_Pos)                      /*!<See AFR15.*/
#define  GPIO_AFRH_AFR8                           GPIO_AFRH_AFR8_Msk
#define  GPIO_AFRH_AFR8_Bit0                      (0x1U << GPIO_AFRH_AFR8_Pos) 
#define  GPIO_AFRH_AFR8_Bit1                      (0x2U << GPIO_AFRH_AFR8_Pos) 
#define  GPIO_AFRH_AFR8_Bit2                      (0x4U << GPIO_AFRH_AFR8_Pos) 
#define  GPIO_AFRH_AFR8_Bit3                      (0x8U << GPIO_AFRH_AFR8_Pos) 
#define  GPIO_AFRH_AFR9_Pos                       (4)
#define  GPIO_AFRH_AFR9_Msk                       (0xFU << GPIO_AFRH_AFR9_Pos)                      /*!<See AFR15.*/
#define  GPIO_AFRH_AFR9                           GPIO_AFRH_AFR9_Msk
#define  GPIO_AFRH_AFR9_Bit0                      (0x1U << GPIO_AFRH_AFR9_Pos) 
#define  GPIO_AFRH_AFR9_Bit1                      (0x2U << GPIO_AFRH_AFR9_Pos) 
#define  GPIO_AFRH_AFR9_Bit2                      (0x4U << GPIO_AFRH_AFR9_Pos) 
#define  GPIO_AFRH_AFR9_Bit3                      (0x8U << GPIO_AFRH_AFR9_Pos) 
#define  GPIO_AFRH_AFR10_Pos                      (8)
#define  GPIO_AFRH_AFR10_Msk                      (0xFU << GPIO_AFRH_AFR10_Pos)                     /*!<See AFR15.*/
#define  GPIO_AFRH_AFR10                          GPIO_AFRH_AFR10_Msk
#define  GPIO_AFRH_AFR10_Bit0                     (0x1U << GPIO_AFRH_AFR10_Pos) 
#define  GPIO_AFRH_AFR10_Bit1                     (0x2U << GPIO_AFRH_AFR10_Pos) 
#define  GPIO_AFRH_AFR10_Bit2                     (0x4U << GPIO_AFRH_AFR10_Pos) 
#define  GPIO_AFRH_AFR10_Bit3                     (0x8U << GPIO_AFRH_AFR10_Pos) 
#define  GPIO_AFRH_AFR11_Pos                      (12)
#define  GPIO_AFRH_AFR11_Msk                      (0xFU << GPIO_AFRH_AFR11_Pos)                     /*!<See AFR15.*/
#define  GPIO_AFRH_AFR11                          GPIO_AFRH_AFR11_Msk
#define  GPIO_AFRH_AFR11_Bit0                     (0x1U << GPIO_AFRH_AFR11_Pos) 
#define  GPIO_AFRH_AFR11_Bit1                     (0x2U << GPIO_AFRH_AFR11_Pos) 
#define  GPIO_AFRH_AFR11_Bit2                     (0x4U << GPIO_AFRH_AFR11_Pos) 
#define  GPIO_AFRH_AFR11_Bit3                     (0x8U << GPIO_AFRH_AFR11_Pos) 
#define  GPIO_AFRH_AFR12_Pos                      (16)
#define  GPIO_AFRH_AFR12_Msk                      (0xFU << GPIO_AFRH_AFR12_Pos)                     /*!<See AFR15.*/
#define  GPIO_AFRH_AFR12                          GPIO_AFRH_AFR12_Msk
#define  GPIO_AFRH_AFR12_Bit0                     (0x1U << GPIO_AFRH_AFR12_Pos) 
#define  GPIO_AFRH_AFR12_Bit1                     (0x2U << GPIO_AFRH_AFR12_Pos) 
#define  GPIO_AFRH_AFR12_Bit2                     (0x4U << GPIO_AFRH_AFR12_Pos) 
#define  GPIO_AFRH_AFR12_Bit3                     (0x8U << GPIO_AFRH_AFR12_Pos) 
#define  GPIO_AFRH_AFR13_Pos                      (20)
#define  GPIO_AFRH_AFR13_Msk                      (0xFU << GPIO_AFRH_AFR13_Pos)                     /*!<See AFR15.*/
#define  GPIO_AFRH_AFR13                          GPIO_AFRH_AFR13_Msk
#define  GPIO_AFRH_AFR13_Bit0                     (0x1U << GPIO_AFRH_AFR13_Pos) 
#define  GPIO_AFRH_AFR13_Bit1                     (0x2U << GPIO_AFRH_AFR13_Pos) 
#define  GPIO_AFRH_AFR13_Bit2                     (0x4U << GPIO_AFRH_AFR13_Pos) 
#define  GPIO_AFRH_AFR13_Bit3                     (0x8U << GPIO_AFRH_AFR13_Pos) 
#define  GPIO_AFRH_AFR14_Pos                      (24)
#define  GPIO_AFRH_AFR14_Msk                      (0xFU << GPIO_AFRH_AFR14_Pos)                     /*!<See AFR15.*/
#define  GPIO_AFRH_AFR14                          GPIO_AFRH_AFR14_Msk
#define  GPIO_AFRH_AFR14_Bit0                     (0x1U << GPIO_AFRH_AFR14_Pos) 
#define  GPIO_AFRH_AFR14_Bit1                     (0x2U << GPIO_AFRH_AFR14_Pos) 
#define  GPIO_AFRH_AFR14_Bit2                     (0x4U << GPIO_AFRH_AFR14_Pos) 
#define  GPIO_AFRH_AFR14_Bit3                     (0x8U << GPIO_AFRH_AFR14_Pos) 
#define  GPIO_AFRH_AFR15_Pos                      (28)
#define  GPIO_AFRH_AFR15_Msk                      (0xFU << GPIO_AFRH_AFR15_Pos)                     /*!<Port x alternate function bit, which can be accessed by software to configure the function.Please refer to the AFRHE register bit description for details.*/
#define  GPIO_AFRH_AFR15                          GPIO_AFRH_AFR15_Msk
#define  GPIO_AFRH_AFR15_Bit0                     (0x1U << GPIO_AFRH_AFR15_Pos) 
#define  GPIO_AFRH_AFR15_Bit1                     (0x2U << GPIO_AFRH_AFR15_Pos) 
#define  GPIO_AFRH_AFR15_Bit2                     (0x4U << GPIO_AFRH_AFR15_Pos) 
#define  GPIO_AFRH_AFR15_Bit3                     (0x8U << GPIO_AFRH_AFR15_Pos) 

/**
  * @brief GPIO_AFRLE Register Bit Definition
  */
#define  GPIO_AFRLE_AFRE0_Pos                     (0)
#define  GPIO_AFRLE_AFRE0_Msk                     (0x1U << GPIO_AFRLE_AFRE0_Pos)                    /*!<See AFRE7*/
#define  GPIO_AFRLE_AFRE0                         GPIO_AFRLE_AFRE0_Msk
#define  GPIO_AFRLE_AFRE1_Pos                     (4)
#define  GPIO_AFRLE_AFRE1_Msk                     (0x1U << GPIO_AFRLE_AFRE1_Pos)                    /*!<See AFRE7*/
#define  GPIO_AFRLE_AFRE1                         GPIO_AFRLE_AFRE1_Msk
#define  GPIO_AFRLE_AFRE2_Pos                     (8)
#define  GPIO_AFRLE_AFRE2_Msk                     (0x1U << GPIO_AFRLE_AFRE2_Pos)                    /*!<See AFRE7*/
#define  GPIO_AFRLE_AFRE2                         GPIO_AFRLE_AFRE2_Msk
#define  GPIO_AFRLE_AFRE3_Pos                     (12)
#define  GPIO_AFRLE_AFRE3_Msk                     (0x1U << GPIO_AFRLE_AFRE3_Pos)                    /*!<See AFRE7*/
#define  GPIO_AFRLE_AFRE3                         GPIO_AFRLE_AFRE3_Msk
#define  GPIO_AFRLE_AFRE4_Pos                     (16)
#define  GPIO_AFRLE_AFRE4_Msk                     (0x1U << GPIO_AFRLE_AFRE4_Pos)                    /*!<See AFRE7*/
#define  GPIO_AFRLE_AFRE4                         GPIO_AFRLE_AFRE4_Msk
#define  GPIO_AFRLE_AFRE5_Pos                     (20)
#define  GPIO_AFRLE_AFRE5_Msk                     (0x1U << GPIO_AFRLE_AFRE5_Pos)                    /*!<See AFRE7*/
#define  GPIO_AFRLE_AFRE5                         GPIO_AFRLE_AFRE5_Msk
#define  GPIO_AFRLE_AFRE6_Pos                     (24)
#define  GPIO_AFRLE_AFRE6_Msk                     (0x1U << GPIO_AFRLE_AFRE6_Pos)                    /*!<See AFRE7*/
#define  GPIO_AFRLE_AFRE6                         GPIO_AFRLE_AFRE6_Msk
#define  GPIO_AFRLE_AFRE7_Pos                     (28)
#define  GPIO_AFRLE_AFRE7_Msk                     (0x1U << GPIO_AFRLE_AFRE7_Pos)                    /*!<Port x alternate extend function bit, which can be accessed by software to configure the function.*/
#define  GPIO_AFRLE_AFRE7                         GPIO_AFRLE_AFRE7_Msk

/**
  * @brief GPIO_AFRHE Register Bit Definition
  */
#define  GPIO_AFRHE_AFRE8_Pos                     (0)
#define  GPIO_AFRHE_AFRE8_Msk                     (0x1U << GPIO_AFRHE_AFRE8_Pos)                    /*!<See AFRE15*/
#define  GPIO_AFRHE_AFRE8                         GPIO_AFRHE_AFRE8_Msk
#define  GPIO_AFRHE_AFRE9_Pos                     (4)
#define  GPIO_AFRHE_AFRE9_Msk                     (0x1U << GPIO_AFRHE_AFRE9_Pos)                    /*!<See AFRE15*/
#define  GPIO_AFRHE_AFRE9                         GPIO_AFRHE_AFRE9_Msk
#define  GPIO_AFRHE_AFRE10_Pos                    (8)
#define  GPIO_AFRHE_AFRE10_Msk                    (0x1U << GPIO_AFRHE_AFRE10_Pos)                   /*!<See AFRE15*/
#define  GPIO_AFRHE_AFRE10                        GPIO_AFRHE_AFRE10_Msk
#define  GPIO_AFRHE_AFRE11_Pos                    (12)
#define  GPIO_AFRHE_AFRE11_Msk                    (0x1U << GPIO_AFRHE_AFRE11_Pos)                   /*!<See AFRE15*/
#define  GPIO_AFRHE_AFRE11                        GPIO_AFRHE_AFRE11_Msk
#define  GPIO_AFRHE_AFRE12_Pos                    (16)
#define  GPIO_AFRHE_AFRE12_Msk                    (0x1U << GPIO_AFRHE_AFRE12_Pos)                   /*!<See AFRE15*/
#define  GPIO_AFRHE_AFRE12                        GPIO_AFRHE_AFRE12_Msk
#define  GPIO_AFRHE_AFRE13_Pos                    (20)
#define  GPIO_AFRHE_AFRE13_Msk                    (0x1U << GPIO_AFRHE_AFRE13_Pos)                   /*!<See AFRE15*/
#define  GPIO_AFRHE_AFRE13                        GPIO_AFRHE_AFRE13_Msk
#define  GPIO_AFRHE_AFRE14_Pos                    (24)
#define  GPIO_AFRHE_AFRE14_Msk                    (0x1U << GPIO_AFRHE_AFRE14_Pos)                   /*!<See AFRE15*/
#define  GPIO_AFRHE_AFRE14                        GPIO_AFRHE_AFRE14_Msk
#define  GPIO_AFRHE_AFRE15_Pos                    (28)
#define  GPIO_AFRHE_AFRE15_Msk                    (0x1U << GPIO_AFRHE_AFRE15_Pos)                   /*!<Port x alternate extend function bit, which can be accessed by software to configure the function.*/
#define  GPIO_AFRHE_AFRE15                        GPIO_AFRHE_AFRE15_Msk


#endif

